Revit 2027 API
FailureDefinitionRegistry Class
 The global registry for all FailureDefinitions in the Revit session.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FailureDefinitionRegistry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class FailureDefinitionRegistry : IDisposable
Public Class FailureDefinitionRegistry
	Implements IDisposable
public ref class FailureDefinitionRegistry : IDisposable
type FailureDefinitionRegistry =
    class
        interface IDisposable
    end
The FailureDefinitionRegistry type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
Methods
Name | Description
Dispose | Releases all resources used by the FailureDefinitionRegistry
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
FindFailureDefinition |  Finds a specific FailureDefinition by a given FailureDefinitionId.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ListAllFailureDefinitions |  Retrieves all the registered FailureDefinitions.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 When a FailureDefinition is created, it will be registered in this registry automatically. Registration is allowed only during Revit Application startup - after that FailureDefinitionRegistry is locked and creation of new FailureDefinitions is not allowed. There is only one instance of FailureDefinitionRegistry in session. GetFailureDefinitionRegistry()
See Also
Reference
Autodesk.Revit.DB Namespace